fe40/tutorials/rheoFoam/OtherTests/Channel2D_VE/GiesekusLog/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{                
                type             GiesekusLog;

                rho              rho [1 -3 0 0 0 0 0] 1.;
                etaS             etaS [1 -1 -1 0 0 0 0] .01;
                etaP             etaP [1 -1 -1 0 0 0 0] .99;             
                lambda           lambda [0 0 1 0 0 0 0] .1;
                alpha            alpha [0 0 0 0 0 0 0] 0.2;
               
                stabilization    coupling;              
}

passiveScalarProperties
{
                solvePassiveScalar   no;
                D                    D [ 0 2 -1 0 0 0 0 ] 1e-9; 
}

// ************************************************************************* //
